using System;
using System.Collections.Generic;
using System.IO;
using System.Text;
using UnityEngine;

public partial class AStar
{
    public const string fileName = "地图.txt";

    public void ImportMap () {
        var fullpath = Path.Combine(dataPath, fileName);
        List<List<int>> map = new List<List<int>>();
        if (!File.Exists(fullpath))
            return;
        using(StreamReader sr = new StreamReader(fullpath))
        {
            string line;
            while ((line = sr.ReadLine()) != null)
            {
                line = line.Replace("\n", "");
                if (line.StartsWith("#", StringComparison.Ordinal))
                    continue;
                var mapline = line.Split(',');
                List<int> list = new List<int>();
                for(int i = 0; i < mapline.Length; i++)
                {
                    list.Add(int.Parse(mapline[i]));
                }
                map.Add(list);
            }
        }
        int row = MapData.GetLength(0);
        int colomn = MapData.GetLength(1);
        for (int i = 0; i < row; i++)
        {
            for(int j = 0; j < colomn; j++)
            {
                try
                {
                    MapData[i, j] = map[i][j];
                }
                catch (Exception ex)
                {
                    MapData[i, j] = 0;
                    Debug.LogWarningFormat("不存在[{0},{1}]数据, {2}", i, j, ex.ToString());
                }
            }
        }
        Debug.LogFormat("导入完成,{0}", fullpath);
        ClickClean();
    }

    public void ExportMap () {
        var fullpath = Path.Combine(dataPath, fileName);
        using(StreamWriter sw = new StreamWriter(fullpath,false,Encoding.UTF8))
        {
            int row = MapData.GetLength(0);
            int colomn = MapData.GetLength(1);
            for (int i=0;i< row;i++)
            {
                var line = new StringBuilder();
                for (int j = 0; j < colomn; j++)
                {
                    if (j == 0)
                        line.Append(MapData[i, j]);
                    else
                        line.Append(',').Append(MapData[i, j]);
                }
                sw.WriteLine(line.ToString());
            }
        }
        Debug.LogFormat("导出成功,{0}",fullpath);
    }

    public static int[,] MapData = {
        { 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 },
        { 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 },
        { 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 },
        { 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 },
        { 0,0,0,0,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 },
        { 0,0,0,1,1,1,1,1,2,2,2,2,2,2,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 },
        { 0,0,1,1,2,2,2,2,2,3,3,3,3,3,2,2,2,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 },
        { 0,0,1,2,2,2,3,3,3,4,4,4,4,4,3,3,3,2,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 },
        { 0,0,1,2,2,2,3,4,4,5,5,4,4,4,4,4,4,3,2,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 },
        { 0,0,1,2,2,2,3,4,5,5,5,5,5,5,5,5,4,3,2,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 },
        { 0,0,1,2,2,2,3,3,4,5,5,5,5,5,5,5,4,3,2,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 },
        { 0,0,1,1,2,2,2,2,3,4,5,5,5,5,5,4,4,3,2,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 },
        { 0,0,0,1,1,1,1,1,2,3,4,4,4,4,4,4,3,2,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 },
        { 0,0,0,1,1,1,0,0,1,2,3,3,3,3,3,3,2,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 },
        { 0,0,0,0,1,1,0,0,0,1,2,2,2,2,2,2,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 },
        { 0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 },
        { 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 },
        { 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 },
        { 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 },
        { 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 },
        { 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 },
        { 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 },
        { 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 },
        { 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }
    };
}
